import React from "react";

export class PrintView extends React.PureComponent {
    render() {
        return (
            <div>
                <img
                    alt="react图标"
                    src={`${process.env.PUBLIC_URL}/logo192.png`}
                />
                My cool content here!
            </div>
        );
    }
}

export const ComponentToPrint = React.forwardRef((props, ref: any) => {
    return (
        <div ref={ref}>
            我勒个去也!我勒个去也!我勒个去也!我勒个去也!我勒个去也! 我勒个去也!
            我勒个去也! 我勒个去也! 我勒个去也! 我勒个去也! 我勒个去也!
            我勒个去也! 我勒个去也! 我勒个去也! 我勒个去也! 我勒个去也!
            我勒个去也! 我勒个去也! 我勒个去也! 我勒个去也! 我勒个去也!
            我勒个去也! 我勒个去也! 我勒个去也! 我勒个去也! 我勒个去也!
            我勒个去也! 我勒个去也! 我勒个去也! 我勒个去也!
            我勒个去也!我勒个去也!我勒个去也!我勒个去也!我勒个去也!我勒个去也!
            我勒个去也! 我勒个去也! 我勒个去也! 我勒个去也! 我勒个去也!
            我勒个去也! 我勒个去也! 我勒个去也! 我勒个去也! 我勒个去也!
            我勒个去也! 我勒个去也! 我勒个去也! 我勒个去也! 我勒个去也!
            我勒个去也! 我勒个去也! 我勒个去也! 我勒个去也! 我勒个去也!
            我勒个去也! 我勒个去也! 我勒个去也! 我勒个去也! 我勒个去也!
            我勒个去也!我勒个去也!我勒个去也!我勒个去也!我勒个去也!我勒个去也!
            我勒个去也! 我勒个去也! 我勒个去也! 我勒个去也! 我勒个去也!
            我勒个去也! 我勒个去也! 我勒个去也! 我勒个去也! 我勒个去也!
            我勒个去也! 我勒个去也! 我勒个去也! 我勒个去也! 我勒个去也!
            我勒个去也! 我勒个去也! 我勒个去也! 我勒个去也! 我勒个去也!
            我勒个去也! 我勒个去也! 我勒个去也! 我勒个去也! 我勒个去也!
            我勒个去也!我勒个去也!我勒个去也!我勒个去也!我勒个去也!我勒个去也!
            我勒个去也! 我勒个去也! 我勒个去也! 我勒个去也! 我勒个去也!
            我勒个去也! 我勒个去也! 我勒个去也! 我勒个去也! 我勒个去也!
            我勒个去也! 我勒个去也! 我勒个去也! 我勒个去也! 我勒个去也!
            我勒个去也! 我勒个去也! 我勒个去也! 我勒个去也! 我勒个去也!
            我勒个去也! 我勒个去也! 我勒个去也! 我勒个去也! 我勒个去也!
            我勒个去也!我勒个去也!我勒个去也!我勒个去也!我勒个去也!我勒个去也!
            我勒个去也! 我勒个去也! 我勒个去也! 我勒个去也! 我勒个去也!
            我勒个去也! 我勒个去也! 我勒个去也! 我勒个去也! 我勒个去也!
            我勒个去也! 我勒个去也! 我勒个去也! 我勒个去也! 我勒个去也!
            我勒个去也! 我勒个去也! 我勒个去也! 我勒个去也! 我勒个去也!
            我勒个去也! 我勒个去也! 我勒个去也! 我勒个去也! 我勒个去也!
            我勒个去也!我勒个去也!我勒个去也!我勒个去也!我勒个去也!我勒个去也!
            我勒个去也! 我勒个去也! 我勒个去也! 我勒个去也! 我勒个去也!
            我勒个去也! 我勒个去也! 我勒个去也! 我勒个去也! 我勒个去也!
            我勒个去也! 我勒个去也! 我勒个去也! 我勒个去也! 我勒个去也!
            我勒个去也! 我勒个去也! 我勒个去也! 我勒个去也! 我勒个去也!
            我勒个去也! 我勒个去也! 我勒个去也! 我勒个去也! 我勒个去也!
            我勒个去也!我勒个去也!我勒个去也!我勒个去也!我勒个去也!我勒个去也!
            我勒个去也! 我勒个去也! 我勒个去也! 我勒个去也! 我勒个去也!
            我勒个去也! 我勒个去也! 我勒个去也! 我勒个去也! 我勒个去也!
            我勒个去也! 我勒个去也! 我勒个去也! 我勒个去也! 我勒个去也!
            我勒个去也! 我勒个去也! 我勒个去也! 我勒个去也! 我勒个去也!
            我勒个去也! 我勒个去也! 我勒个去也! 我勒个去也! 我勒个去也!
            我勒个去也!我勒个去也!我勒个去也!我勒个去也!我勒个去也!我勒个去也!
            我勒个去也! 我勒个去也! 我勒个去也! 我勒个去也! 我勒个去也!
            我勒个去也! 我勒个去也! 我勒个去也! 我勒个去也! 我勒个去也!
            我勒个去也! 我勒个去也! 我勒个去也! 我勒个去也! 我勒个去也!
            我勒个去也! 我勒个去也! 我勒个去也! 我勒个去也! 我勒个去也!
            我勒个去也! 我勒个去也! 我勒个去也! 我勒个去也! 我勒个去也!
            我勒个去也!我勒个去也!我勒个去也!我勒个去也!我勒个去也!我勒个去也!
            我勒个去也! 我勒个去也! 我勒个去也! 我勒个去也! 我勒个去也!
            我勒个去也! 我勒个去也! 我勒个去也! 我勒个去也! 我勒个去也!
            我勒个去也! 我勒个去也! 我勒个去也! 我勒个去也! 我勒个去也!
            我勒个去也! 我勒个去也! 我勒个去也! 我勒个去也! 我勒个去也!
            我勒个去也! 我勒个去也! 我勒个去也! 我勒个去也! 我勒个去也!
            我勒个去也!我勒个去也!我勒个去也!我勒个去也!我勒个去也!我勒个去也!
            我勒个去也! 我勒个去也! 我勒个去也! 我勒个去也! 我勒个去也!
            我勒个去也! 我勒个去也! 我勒个去也! 我勒个去也! 我勒个去也!
            我勒个去也! 我勒个去也! 我勒个去也! 我勒个去也! 我勒个去也!
            我勒个去也! 我勒个去也! 我勒个去也! 我勒个去也! 我勒个去也!
            我勒个去也! 我勒个去也! 我勒个去也! 我勒个去也! 我勒个去也!
            我勒个去也!我勒个去也!我勒个去也!我勒个去也!我勒个去也!我勒个去也!
            我勒个去也! 我勒个去也! 我勒个去也! 我勒个去也! 我勒个去也!
            我勒个去也! 我勒个去也! 我勒个去也! 我勒个去也! 我勒个去也!
            我勒个去也! 我勒个去也! 我勒个去也! 我勒个去也! 我勒个去也!
            我勒个去也! 我勒个去也! 我勒个去也! 我勒个去也! 我勒个去也!
            我勒个去也! 我勒个去也! 我勒个去也! 我勒个去也! 我勒个去也!
            我勒个去也!我勒个去也!我勒个去也!我勒个去也!我勒个去也!我勒个去也!
            我勒个去也! 我勒个去也! 我勒个去也! 我勒个去也! 我勒个去也!
            我勒个去也! 我勒个去也! 我勒个去也! 我勒个去也! 我勒个去也!
            我勒个去也! 我勒个去也! 我勒个去也! 我勒个去也! 我勒个去也!
            我勒个去也! 我勒个去也! 我勒个去也! 我勒个去也! 我勒个去也!
            我勒个去也! 我勒个去也! 我勒个去也! 我勒个去也! 我勒个去也!
            我勒个去也!我勒个去也!我勒个去也!我勒个去也!我勒个去也!我勒个去也!
            我勒个去也! 我勒个去也! 我勒个去也! 我勒个去也! 我勒个去也!
            我勒个去也! 我勒个去也! 我勒个去也! 我勒个去也! 我勒个去也!
            我勒个去也! 我勒个去也! 我勒个去也! 我勒个去也! 我勒个去也!
            我勒个去也! 我勒个去也! 我勒个去也! 我勒个去也! 我勒个去也!
            我勒个去也! 我勒个去也! 我勒个去也! 我勒个去也! 我勒个去也!
            我勒个去也!我勒个去也!我勒个去也!我勒个去也!我勒个去也!我勒个去也!
            我勒个去也! 我勒个去也! 我勒个去也! 我勒个去也! 我勒个去也!
            我勒个去也! 我勒个去也! 我勒个去也! 我勒个去也! 我勒个去也!
            我勒个去也! 我勒个去也! 我勒个去也! 我勒个去也! 我勒个去也!
            我勒个去也! 我勒个去也! 我勒个去也! 我勒个去也! 我勒个去也!
            我勒个去也! 我勒个去也! 我勒个去也! 我勒个去也! 我勒个去也!
            我勒个去也!我勒个去也!我勒个去也!我勒个去也!我勒个去也!我勒个去也!
            我勒个去也! 我勒个去也! 我勒个去也! 我勒个去也! 我勒个去也!
            我勒个去也! 我勒个去也! 我勒个去也! 我勒个去也! 我勒个去也!
            我勒个去也! 我勒个去也! 我勒个去也! 我勒个去也! 我勒个去也!
            我勒个去也! 我勒个去也! 我勒个去也! 我勒个去也! 我勒个去也!
            我勒个去也! 我勒个去也! 我勒个去也! 我勒个去也! 我勒个去也!
            我勒个去也!我勒个去也!我勒个去也!我勒个去也!我勒个去也!我勒个去也!
            我勒个去也! 我勒个去也! 我勒个去也! 我勒个去也! 我勒个去也!
            我勒个去也! 我勒个去也! 我勒个去也! 我勒个去也! 我勒个去也!
            我勒个去也! 我勒个去也! 我勒个去也! 我勒个去也! 我勒个去也!
            我勒个去也! 我勒个去也! 我勒个去也! 我勒个去也! 我勒个去也!
            我勒个去也! 我勒个去也! 我勒个去也! 我勒个去也! 我勒个去也!
            我勒个去也!我勒个去也!我勒个去也!我勒个去也!我勒个去也!我勒个去也!
            我勒个去也! 我勒个去也! 我勒个去也! 我勒个去也! 我勒个去也!
            我勒个去也! 我勒个去也! 我勒个去也! 我勒个去也! 我勒个去也!
            我勒个去也! 我勒个去也! 我勒个去也! 我勒个去也! 我勒个去也!
            我勒个去也! 我勒个去也! 我勒个去也! 我勒个去也! 我勒个去也!
            我勒个去也! 我勒个去也! 我勒个去也! 我勒个去也! 我勒个去也!
            我勒个去也!我勒个去也!我勒个去也!我勒个去也!我勒个去也!我勒个去也!
            我勒个去也! 我勒个去也! 我勒个去也! 我勒个去也! 我勒个去也!
            我勒个去也! 我勒个去也! 我勒个去也! 我勒个去也! 我勒个去也!
            我勒个去也! 我勒个去也! 我勒个去也! 我勒个去也! 我勒个去也!
            我勒个去也! 我勒个去也! 我勒个去也! 我勒个去也! 我勒个去也!
            我勒个去也! 我勒个去也! 我勒个去也! 我勒个去也! 我勒个去也!
            我勒个去也!
        </div>
    );
});
